app/controllers/coins_controller.rb

  def update
    respond_to do |format|
      if @coin.update(coin_params)
---
UPDATE "coins" SET "mining_type_id" = ?, "updated_at" = ? WHERE "coins"."id" = ?  [["mining_type_id", 2], ["updated_at", "2020-05-18 13:03:34.070217"], ["id", 1]]

    def show_mining_type_options
      @show_mining_type_options = MiningType.all.pluck(:description, :id)
---
SELECT "mining_types"."description", "mining_types"."id" FROM "mining_types"